app/controllers/job_alerts_controller.rb

SELECT "job_alerts".* FROM "job_alerts"
---
  def index
    @job_alerts = JobAlert.all

INSERT INTO "job_alerts" ("email", "freqency", "job_relate_title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "ki.ey.kouch@gmail.com"], ["freqency", "Daily"], ["job_relate_title", "Software"], ["created_at", "2016-06-13 00:37:20.535934"], ["updated_at", "2016-06-13 00:37:20.535934"]]
---
  def create
    @job_alert = JobAlert.new(job_alert_params)



    # respond_to do |format|
    #   if @job_alert.save
    #     format.html { redirect_to @job_alert, notice: 'Job Alert was successfully created.' }
    #     format.json { render json: @job_alert, status: :created, location: @job_alert }

    #   else
    #     format.html { render action: "new" }
    #     format.json { render json: @job_alert.errors, status: :unprocessable_entity }

    #   end
    # end

    if @job_alert.save

SELECT  "job_alerts".* FROM "job_alerts" WHERE "job_alerts"."id" = ? LIMIT 1  [["id", nil]]
---
    def set_job_alert
      @job_alert = JobAlert.find(params[:id])